app/Models/M_kapal.php

SELECT *
FROM `kapal`
---
    public function ambilData($id = false)
    {
        if ($id === false) {
            return $this->db->table($this->table)->get()->getResult();