app/Models/M_pesantiket.php

SELECT *
FROM `pesantiket`
SELECT *
FROM `pesantiket`
WHERE `id_pemesanan` = '7'
---
    public function ambilData($id = false)
    {
        if ($id === false) {
            return $this->db->table($this->table)->get()->getResult();
        } else {
            return $this->getWhere(['id_pemesanan' => $id]);

SELECT *
FROM `pesantiket`
JOIN `rekening` ON `rekening`.`id_pembayaran`=`pesantiket`.`id_pembayaran`
WHERE `id_pengguna` IS NULL
---
    public function cariId($id)
    {
        return $this->db->table($this->table)
            ->join('rekening', 'rekening.id_pembayaran=pesantiket.id_pembayaran')
            ->where(['id_pengguna' => $id])->get()->getResult();

UPDATE `pesantiket` SET `gambar` = '1673174126_f8b73eb9bf0a3ee149e7.png', `aksi` = '2'
WHERE `id_pemesanan` = '8'
---
    public function ubah($data, $id)
    {
        $ubah = $this->db->table($this->table);
        $ubah->where(['id_pemesanan' => $id]);
        return $ubah->update($data);